Riconec/iCE5_SG48DK/STM32/SPI_CDC/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2017 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f0xx_hal.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include "usbd_cdc_if.h"
//#include "string.h"
#include <inttypes.h>

#define BUFF_SIZE 40
#define MIN_COMMAND_LENGTH 11

#define WRITE_ENABLE_CMD 0x06 //+
#define WRITE_DISABLE_CMD 0x04 //+ 
#define READ_IDENT_CMD 0x9f //
#define READ_STATUS_CMD 0x05 //+
#define WRITE_STATUS_CMD 0x01 //+
#define READ_DATA_CMD 0x03 //+
#define READ_DATA_FAST_CMD 0x0b //-
#define PAGE_PROG_CMD 0x02 //+
#define SECTOR_ERASE_CMD 0xd8 //+
#define BULK_ERASE_CMD 0xc7 // +
#define DEEP_PWR_DOWN_CMD 0xb9 // +
#define DEEP_PWR_WAKE_CMD 0xab  //+

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
SPI_HandleTypeDef hspi1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
	char spi_rx_buf[BUFF_SIZE], spi_tx_buf[BUFF_SIZE];
	char cdc_rx_buf[64];
	uint8_t command_received = 0;
	
	char data_buf[64] = "";
	
	unsigned int int_temp = 255;
	unsigned int address_page = 0;
	
	const char FLASH_WAKE_COMMAND[] = "RESL";
	const char FLASH_WAKE_RESPONSE[] = "FLSH:RESL:OK!;\r";
	//+
	const char FLASH_SLEEP_COMMAND[] = "DEPO";
	const char FLASH_SLEEP_RESPONSE[] = "FLSH:DEPO:OK!;\r";
	//+
	const char FLASH_WE_COMMAND[] = "WREN";
	const char FLASH_WE_RESPONSE[] = "FLSH:WREN:OK!;\r";
	//+
	const char FLASH_WD_COMMAND[] = "WRDI";
	const char FLASH_WD_RESPONSE[] = "FLSH:WRDI:OK!;\r";
	//+
	const char FLASH_BULK_COMMAND[] = "BUER";
	const char FLASH_BULK_RESPONSE[] = "FLSH:BUER:OK!;\r";
	
	const char FLASH_STAT_R_COMMAND[] = "RDSR";
	const char FLASH_STAT_R_RESPONSE[] = "FLSH:RDSR:0x%02x;\r";
	//+
	const char FLASH_STAT_W_COMMAND[] = "WRSR";
	const char FLASH_STAT_W_RESPONSE[] = "FLSH:WRSR:OK!;\r";
	//+
	const char FLASH_SERASE_COMMAND[] = "SEER";
	const char FLASH_SERASE_RESPONSE[] = "FLSH:SEER:OK!;\r";
	
	const char FLASH_PAGEA_COMMAND[] = "PPAR";
	const char FLASH_PAGEA_RESPONSE[] = "FLSH:PPAR:OK!;\r";
	
	const char FLASH_PAGEB_COMMAND[] = "PPBR";
	const char FLASH_PAGEB_RESPONSE[] = "FLSH:PPBR:OK!;\r";
	
	const char FLASH_PAGEC_COMMAND[] = "PPCO";
	const char FLASH_PAGEC_RESPONSE[] = "FLSH:PPCO:OK!;\r";
	
	const char FLASH_READ_COMMAND[] = "READ";
	const char FLASH_READ_RESPONSE[] = "FLSH:READ:0x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x;\r";
	
	const char FPGA_RST_COMMAND[] = "RSTN";
	const char FPGA_RST_RESPONSE[] = "FPGA:RSTN:OK!\r;";
	
	const char FPGA_SET_COMMAND[] = "FSET";
	const char FPGA_SET_RESPONSE[] = "FPGA:FSET:OK!;\r";
	
	const char FPGA_INIT_SLAVE_COMMAND[] = "COSL";
	const char FPGA_INIT_SLAVE_RESPONSE[] = "FPGA:COSL:OK!;\r";
	
	const char FPGA_CDONE_SLAVE_COMMAND[] = "CODO";
	const char FPGA_CDONE_SLAVE_RESPONSE[] = "FPGA:CODO:0x%02x;\r";
	
	const char FPGA_CONFIG_WRITE16_COMMAND[] = "COWR";
	const char FPGA_CONFIG_WRITE16_RESPONSE[] = "FPGA:COWR:OK!;\r";
	
	const char SOFT_IDEN_COMMAND[] = "IDEN";
	const char SOFT_IDEN_RESPONSE[] = "SOFT:IDEN:iCE5LP;\r";
	
	const char SOFT_VERS_COMMAND[] = "VERS";
	const char SOFT_VERS_RESPONSE[] = "SOFT:VERS:v1.0;\r";
	
	const char SSPI_DEINIT_COMMAND[] = "DEIN";
	const char SSPI_DEINIT_RESPONSE[] = "SSPI:DEIN:OK!;\r";
	
	const char SSPI_INIT_COMMAND[] = "INIT";
	const char SSPI_INIT_RESPONSE[] = "SSPI:INIT:OK!;\r";
	
	const char FLSH_SYSTEM[] = "FLSH";
	const char FPGA_SYSTEM[] = "FPGA";
	const char SSPI_SYSTEM[] = "SSPI";
	const char SOFT_SYSTEM[] = "SOFT";
	
	char system_str[5] = "";
	char command_str[5] = "";
	char argument_str[40] = "";
	
	
	
/* USER CODE END PV */

