Riconec/iCE5_SG48DK/STM32/SPI_CDC/Src/main.c
/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint8_t SPI_FLASH_WAKE(){
	spi_tx_buf[0] = DEEP_PWR_WAKE_CMD;
	spi_tx_buf[1] = DEEP_PWR_WAKE_CMD;
	spi_tx_buf[2] = DEEP_PWR_WAKE_CMD;
	spi_tx_buf[3] = DEEP_PWR_WAKE_CMD;
	spi_tx_buf[4] = DEEP_PWR_WAKE_CMD;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_TransmitReceive(&hspi1, (uint8_t*) spi_tx_buf, (uint8_t*)spi_rx_buf, 5, 1000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
	return spi_rx_buf[5];
}
void SPI_FLASH_SLEEP(){
	spi_tx_buf[0] = DEEP_PWR_DOWN_CMD;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi1, (uint8_t*)spi_tx_buf, 1, 1000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
}
uint8_t SPI_FLASH_READ_STATUS(void){
	spi_tx_buf[0] = READ_STATUS_CMD;
	spi_tx_buf[1] = READ_STATUS_CMD;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_TransmitReceive(&hspi1, (uint8_t*)spi_tx_buf, (uint8_t*)spi_rx_buf, 2, 1000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
	return spi_rx_buf[1];
}
uint8_t SPI_FLASH_WRITE_STATUS(uint8_t status){
	spi_tx_buf[0] = WRITE_STATUS_CMD;
	spi_tx_buf[1] = status;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_TransmitReceive(&hspi1, (uint8_t*)spi_tx_buf, (uint8_t*)spi_rx_buf, 2, 1000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
	return spi_rx_buf[1];
}

void SPI_FLASH_WRITE_ENABLE(void){
	spi_tx_buf[0] = WRITE_ENABLE_CMD;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi1, (uint8_t*)spi_tx_buf, 1, 1000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
}
void SPI_FLASH_WRITE_DISABLE(void){
	spi_tx_buf[0] = WRITE_DISABLE_CMD;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	//
	//HAL_SPI_Transmit()
	HAL_SPI_Transmit(&hspi1, (uint8_t*)spi_tx_buf, 1, 1000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
}

void SPI_FLASH_READ(int addr, int num_to_read){
	spi_tx_buf[0] = READ_DATA_CMD;
	spi_tx_buf[1] = (addr>>16);
	spi_tx_buf[2] = (addr>>8);
	spi_tx_buf[3] = addr;
	for (uint8_t i = 0; i < num_to_read; i++){
		spi_tx_buf[i+4] = READ_DATA_CMD;
	}
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_TransmitReceive(&hspi1, (uint8_t*)spi_tx_buf, (uint8_t*)spi_rx_buf, num_to_read+4, 2000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
}

void SPI_FLASH_PAGE_INIT(int addr){
	spi_tx_buf[0] = PAGE_PROG_CMD;
	spi_tx_buf[1] = (addr>>16);
	spi_tx_buf[2] = (addr>>8);
	spi_tx_buf[3] = addr;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi1, (uint8_t*)spi_tx_buf, 4 , 2000);
}
void SPI_FLASH_PAGE_PROG(int num_to_write){
	HAL_SPI_Transmit(&hspi1, (uint8_t*)spi_tx_buf, num_to_write, 4000);
}

void SPI_FLASH_PAGE_COMMIT(){
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
}

void SPI_FLASH_SECTOR_ERASE(int addr){
	spi_tx_buf[0] = SECTOR_ERASE_CMD;
	spi_tx_buf[1] = (addr>>16);
	spi_tx_buf[2] = (addr>>8);
	spi_tx_buf[3] = addr;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi1, (uint8_t*)spi_tx_buf, 4, 2000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
}

void SPI_FLASH_BULK_ERASE (void){
	spi_tx_buf[0] = BULK_ERASE_CMD;
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
	HAL_SPI_Transmit(&hspi1, (uint8_t*)spi_tx_buf, 1, 2000);
	HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
}


void ParseCDCCommand(void){
		//------------------------------------------------------------------------
		// Commands in format SYSTEM:COMMAND;
		//------------------------------------------------------------------------
	if(strlen(cdc_rx_buf) == MIN_COMMAND_LENGTH){
		sscanf(cdc_rx_buf, "%4s:%4s;\r", system_str, command_str);
		if(strcmp(system_str, FLSH_SYSTEM) == 0){
			if(strcmp(command_str, FLASH_WAKE_COMMAND) == 0){
				SPI_FLASH_WAKE();
				CDC_Transmit_FS((uint8_t*)FLASH_WAKE_RESPONSE, strlen(FLASH_WAKE_RESPONSE));
			}
			else if(strcmp(command_str, FLASH_SLEEP_COMMAND) == 0){
				SPI_FLASH_SLEEP();
				CDC_Transmit_FS((uint8_t*)FLASH_SLEEP_RESPONSE, strlen(FLASH_SLEEP_RESPONSE));
			}
			else if(strcmp(command_str, FLASH_WE_COMMAND) == 0){
				SPI_FLASH_WRITE_ENABLE();
				CDC_Transmit_FS((uint8_t*)FLASH_WE_RESPONSE, strlen(FLASH_WE_RESPONSE));
			}
			else if(strcmp(command_str, FLASH_WD_COMMAND) == 0){
				SPI_FLASH_WRITE_DISABLE();
				CDC_Transmit_FS((uint8_t*)FLASH_WD_RESPONSE, strlen(FLASH_WD_RESPONSE));
			}
			else if(strcmp(command_str, FLASH_STAT_R_COMMAND) == 0){
				int_temp = SPI_FLASH_READ_STATUS();
				sprintf(data_buf, FLASH_STAT_R_RESPONSE, int_temp);
				CDC_Transmit_FS((uint8_t*)data_buf, strlen(data_buf));
			}
			else if(strcmp(command_str, FLASH_BULK_COMMAND) == 0){
				SPI_FLASH_BULK_ERASE();
				CDC_Transmit_FS((uint8_t*)FLASH_BULK_RESPONSE, strlen(FLASH_BULK_RESPONSE));
			}
			else if(strcmp(command_str, FLASH_PAGEC_COMMAND) == 0){
				SPI_FLASH_PAGE_COMMIT();
				CDC_Transmit_FS((uint8_t*)FLASH_PAGEC_RESPONSE, strlen(FLASH_PAGEC_RESPONSE));
			}
			else {
				//unknown command received
				CDC_Transmit_FS((uint8_t*)"FLSH:EROR;\r", strlen("FLSH:EROR;\r"));
			}
		}
		else if(strcmp(system_str, FPGA_SYSTEM) == 0){
			if(strcmp(command_str, FPGA_RST_COMMAND) == 0){
				HAL_SPI_Init(&hspi1);
				HAL_GPIO_DeInit(SPI_SS_GPIO_Port, SPI_SS_Pin);
				HAL_GPIO_WritePin(CRESET_GPIO_Port, CRESET_Pin, GPIO_PIN_RESET);
				CDC_Transmit_FS((uint8_t*)FPGA_RST_RESPONSE, strlen(FPGA_RST_RESPONSE));
				//FPGA_RST_RESPONSE
			}
			else if(strcmp(command_str, FPGA_SET_COMMAND) == 0){
				HAL_SPI_DeInit(&hspi1);
				HAL_GPIO_DeInit(SPI_SS_GPIO_Port, SPI_SS_Pin);
				HAL_GPIO_WritePin(CRESET_GPIO_Port, CRESET_Pin, GPIO_PIN_SET);
				CDC_Transmit_FS((uint8_t*)FPGA_SET_RESPONSE, strlen(FPGA_SET_RESPONSE));
			}
			else if (strcmp(command_str, FPGA_INIT_SLAVE_COMMAND) == 0){
				HAL_GPIO_WritePin(CRESET_GPIO_Port, CRESET_Pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_RESET);
				HAL_Delay(2);
				HAL_GPIO_WritePin(CRESET_GPIO_Port, CRESET_Pin, GPIO_PIN_SET);
				HAL_Delay(2);				
				CDC_Transmit_FS((uint8_t*)FPGA_INIT_SLAVE_RESPONSE, strlen(FPGA_INIT_SLAVE_RESPONSE));
				//MISO can be checked to see if housekeeping done
			}
			else if (strcmp(command_str, FPGA_CDONE_SLAVE_COMMAND) == 0){
				if(HAL_GPIO_ReadPin(CDONE_GPIO_Port, CDONE_Pin) == GPIO_PIN_SET){
					int_temp = 1;
				}
				else{
					int_temp = 0;
				}
				HAL_GPIO_WritePin(CRESET_GPIO_Port, CRESET_Pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(SPI_SS_GPIO_Port, SPI_SS_Pin, GPIO_PIN_SET);
				sprintf(data_buf, FPGA_CDONE_SLAVE_RESPONSE, int_temp);
				CDC_Transmit_FS((uint8_t*)data_buf, strlen(data_buf));
				//shift 49 or 100 bits here
				//SPI_FLASH_PAGE_PROG(16);
				//be carefull here
			}
			//else if (strcmp(command_str, FPGA_
			else {
				CDC_Transmit_FS((uint8_t*)"FPGA:EROR;\r", strlen("FPGA:EROR;\r"));
			}
		}
		else if(strcmp(system_str, SSPI_SYSTEM) == 0){
			if(strcmp(command_str, SSPI_DEINIT_COMMAND) == 0){
				HAL_SPI_DeInit(&hspi1);
				CDC_Transmit_FS((uint8_t*)SSPI_DEINIT_RESPONSE, strlen(SSPI_DEINIT_RESPONSE));
			}
			if(strcmp(command_str, SSPI_INIT_COMMAND) == 0){
				HAL_SPI_Init(&hspi1);
				CDC_Transmit_FS((uint8_t*)SSPI_INIT_RESPONSE, strlen(SSPI_INIT_RESPONSE));
			}
			//error case
			CDC_Transmit_FS((uint8_t*)"SSPI:EROR;\r", strlen("SSPI:EROR;\r"));
		}
		else if(strcmp(system_str, SOFT_SYSTEM) == 0){
			if(strcmp(command_str, SOFT_IDEN_COMMAND) == 0){
				CDC_Transmit_FS((uint8_t*)SOFT_IDEN_RESPONSE, strlen(SOFT_IDEN_RESPONSE));
			}
			else if(strcmp(command_str, SOFT_VERS_COMMAND) == 0){
				CDC_Transmit_FS((uint8_t*)SOFT_VERS_RESPONSE, strlen(SOFT_VERS_RESPONSE));
			}
			//error case
			else {
				CDC_Transmit_FS((uint8_t*)"SOFT:EROR;\r", strlen("SOFT:EROR;\r"));
			}
		}
	}	
		//------------------------------------------------------------------------
		// Commands in format SYSTEM:COMMAND:ARGUMENT;
		//------------------------------------------------------------------------
	else if(strlen(cdc_rx_buf) >= MIN_COMMAND_LENGTH){
		sscanf(cdc_rx_buf, "%4s:%4s:%s;\r", system_str, command_str, argument_str);
		if(strcmp(system_str, FLSH_SYSTEM) == 0){
			if(strcmp(command_str, FLASH_STAT_W_COMMAND) == 0){
				sscanf(argument_str, "0x%02x;", &int_temp);
				SPI_FLASH_WRITE_STATUS(int_temp);
				CDC_Transmit_FS((uint8_t*)FLASH_STAT_W_RESPONSE, strlen(FLASH_STAT_W_RESPONSE));
			}
			else if(strcmp(command_str, FLASH_SERASE_COMMAND) == 0){
				sscanf(argument_str, "0x%06x;", &int_temp);
				SPI_FLASH_SECTOR_ERASE(int_temp);
				CDC_Transmit_FS((uint8_t*)FLASH_SERASE_RESPONSE, strlen(FLASH_SERASE_RESPONSE));
			}
			else if(strcmp(command_str, FLASH_PAGEA_COMMAND) == 0){
				sscanf(argument_str, "0x%06x;", &int_temp);
				SPI_FLASH_PAGE_INIT(int_temp);
				CDC_Transmit_FS((uint8_t*)FLASH_PAGEA_RESPONSE, strlen(FLASH_PAGEA_RESPONSE));
			}
			else if(strcmp(command_str, FLASH_READ_COMMAND) == 0){
				sscanf(argument_str, "0x%06x;", &int_temp);
				SPI_FLASH_READ(int_temp, 16);
				sprintf(data_buf, FLASH_READ_RESPONSE, spi_rx_buf[4],spi_rx_buf[5],spi_rx_buf[6],spi_rx_buf[7],spi_rx_buf[8],spi_rx_buf[9],
				spi_rx_buf[10],spi_rx_buf[11],spi_rx_buf[12],spi_rx_buf[13],spi_rx_buf[14],spi_rx_buf[15],spi_rx_buf[16],spi_rx_buf[17],spi_rx_buf[18],spi_rx_buf[19]); //"FLSH:READ:0x%02%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x%02x\r\n";
				CDC_Transmit_FS((uint8_t*)data_buf, strlen(data_buf));
			}
			else if(strcmp(command_str, FLASH_PAGEB_COMMAND) == 0){
				sscanf(argument_str, "0x%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx;", &spi_tx_buf[0],&spi_tx_buf[1],&spi_tx_buf[2],&spi_tx_buf[3],&spi_tx_buf[4],
				&spi_tx_buf[5],&spi_tx_buf[6],&spi_tx_buf[7],&spi_tx_buf[8],&spi_tx_buf[9],&spi_tx_buf[10],&spi_tx_buf[11],&spi_tx_buf[12],&spi_tx_buf[13],&spi_tx_buf[14],&spi_tx_buf[15]);
				SPI_FLASH_PAGE_PROG(16);
				CDC_Transmit_FS((uint8_t*)FLASH_PAGEB_RESPONSE, strlen(FLASH_PAGEB_RESPONSE));
			}
			else {
				CDC_Transmit_FS((uint8_t*)"FLSH:EROR;\r", strlen("FLSH:EROR;\r"));
			}
		}
		else if(strcmp(system_str, FPGA_SYSTEM) == 0){
			if (strcmp(command_str, FPGA_CONFIG_WRITE16_COMMAND) == 0){
				int_temp = sscanf(argument_str, "0x%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx%02hhx;", &spi_tx_buf[0],&spi_tx_buf[1],&spi_tx_buf[2],&spi_tx_buf[3],&spi_tx_buf[4],
				&spi_tx_buf[5],&spi_tx_buf[6],&spi_tx_buf[7],&spi_tx_buf[8],&spi_tx_buf[9],&spi_tx_buf[10],&spi_tx_buf[11],&spi_tx_buf[12],&spi_tx_buf[13],&spi_tx_buf[14],&spi_tx_buf[15]);
				SPI_FLASH_PAGE_PROG(16);
				CDC_Transmit_FS((uint8_t*)FPGA_CONFIG_WRITE16_RESPONSE, strlen(FPGA_CONFIG_WRITE16_RESPONSE));
				
